## Pandas-> Panel data
* data analysis 
* one of the powerful tool/package for preprocessing
* datas represented in table format

### Agenda

* Series-Creation,Attributes,Methods
* DataFrame-Creation,Attributes,Methods
* Indexing and Selction

### Series
* single col,multiple rows

In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series([5,8,2,81,54])
s1

0     5
1     8
2     2
3    81
4    54
dtype: int64

In [3]:
type(s1)

pandas.core.series.Series

In [4]:
s1.index=[11,22,33,44,55] # name the rows
s1

11     5
22     8
33     2
44    81
55    54
dtype: int64

In [6]:
s2= pd.Series(np.arange(5).reshape(5,),index=['r1','r2','r3','r4','r5'])
s2

r1    0
r2    1
r3    2
r4    3
r5    4
dtype: int32

In [7]:
# Attributes
s1.shape

(5,)

In [8]:
s1.size

5

In [9]:
s1.dtype

dtype('int64')

In [30]:
s1[2:4]

33     2
44    81
dtype: int64

In [15]:
# Extract the values
s1[33]

2

In [16]:
s1[[33,55]]

33     2
55    54
dtype: int64

In [17]:
s2

r1    0
r2    1
r3    2
r4    3
r5    4
dtype: int32

In [18]:
# Extract 1 to 3
s2[1:4]

r2    1
r3    2
r4    3
dtype: int32

In [19]:
s2[['r2','r3','r4']]

r2    1
r3    2
r4    3
dtype: int32

In [21]:
s2['r2':'r4']

r2    1
r3    2
r4    3
dtype: int32

In [27]:
s2[1:4]

r2    1
r3    2
r4    3
dtype: int32

In [28]:
s2[1]

1

## DataFrame
* 2D data, multiple rows and columns
* similar to Excel

In [22]:
# Create datas with list,tuples,dict,array
d1 = pd.DataFrame([[5,6,7],[3,5,6],[8,3,1]])
d1

   0  1  2
0  5  6  7
1  3  5  6
2  8  3  1

In [23]:
type(d1)

pandas.core.frame.DataFrame

In [24]:
#DF with nested tuple
d2 = pd.DataFrame(((5,6,7),(3,5,6),(8,3,1)))
d2

   0  1  2
0  5  6  7
1  3  5  6
2  8  3  1

In [25]:
type(d2)

pandas.core.frame.DataFrame

In [26]:
# DF with Dcictionary
d3 = pd.DataFrame({'A':[5,6,7],'B':[3,5,6],'C':[8,3,1]})
d3

   A  B  C
0  5  3  8
1  6  5  3
2  7  6  1

In [31]:
d2.index='r1 r2 r3'.split()
d2.columns = 'c1 c2 c3'.split()
d2

    c1  c2  c3
r1   5   6   7
r2   3   5   6
r3   8   3   1

In [32]:
# Create a DF with random integer nos and reshape it as (4,3) and row name is r1,r2..c1,c2
d4 = pd.DataFrame(np.random.randint(1,100,12).reshape(4,3),index = 'r1 r2 r3 r4'.split(), columns = 'c1 c2 c3'.split())
d4

    c1  c2  c3
r1  92  89  93
r2  78  77  12
r3  34  36  51
r4  51  30  51

In [33]:
# Create a DF with arange function from 51 to 70 and reshape as (5,4) rows->11 22..55 col->A,B,C,D
d5 = pd.DataFrame(np.arange(51,71).reshape(5,4),index = '11 22 33 44 55'.split(),columns = 'A B C D'.split())
d5

     A   B   C   D
11  51  52  53  54
22  55  56  57  58
33  59  60  61  62
44  63  64  65  66
55  67  68  69  70

In [34]:
# Attributes
d5.shape

(5, 4)

In [35]:
d5.size

20

In [37]:
d5.C.dtype

dtype('int32')

In [40]:
d5.A.dtype

dtype('int32')

In [38]:
d5.ndim

2

In [39]:
d5.axes

[Index(['11', '22', '33', '44', '55'], dtype='object'),
 Index(['A', 'B', 'C', 'D'], dtype='object')]

In [45]:
d5.dtypes

A    int32
B    int32
C    int32
D    int32
dtype: object

In [44]:
# MEthods
d5.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 11 to 55
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int32
 1   B       5 non-null      int32
 2   C       5 non-null      int32
 3   D       5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [47]:
d5

     A   B   C   D
11  51  52  53  54
22  55  56  57  58
33  59  60  61  62
44  63  64  65  66
55  67  68  69  70

In [46]:
# Grabbing the datas with iloc,loc and condition
d5.iloc[1:4,3:]

     D
22  58
33  62
44  66

In [49]:
# Q) Extract 1 to 3 rows with 2nd column
d5.iloc[0:3,1]

11    52
22    56
33    60
Name: B, dtype: int32

In [59]:
#Extract 1 to 3 rows with 2nd column
d5.loc['11':'33','B']

11    52
22    56
33    60
Name: B, dtype: int32

In [60]:
d4

    c1  c2  c3
r1  92  89  93
r2  78  77  12
r3  34  36  51
r4  51  30  51

In [61]:
# Extract 1st row n 4th row and 2nd & 3rd colum 
d4.loc[['r1','r4'],['c2','c3']]

    c2  c3
r1  89  93
r4  30  51

In [62]:
# Condition
d4>20

      c1    c2     c3
r1  True  True   True
r2  True  True  False
r3  True  True   True
r4  True  True   True

In [63]:
d4[d4>20]

    c1  c2    c3
r1  92  89  93.0
r2  78  77   NaN
r3  34  36  51.0
r4  51  30  51.0

In [64]:
d4[d4>20]['c3']

r1    93.0
r2     NaN
r3    51.0
r4    51.0
Name: c3, dtype: float64

In [66]:
d4[d4>20][['c3','c1']]

      c3  c1
r1  93.0  92
r2   NaN  78
r3  51.0  34
r4  51.0  51